messages/private-certifier/01A_ReceiptAcknowledgement.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
			<u:Timestamp u:Id="_0">
				<u:Created>2012-11-25T23:39:22.425Z</u:Created>
				<u:Expires>2012-11-25T23:44:22.425Z</u:Expires>
			</u:Timestamp>
		</o:Security>
	</s:Header>
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<ReceiptAcknowledgementSignal xmlns="http://xml.gov.au/edais/bs/ReceiptAcknowledgementSignal.msg.2.3.0r2">
			<ReceiptAcknowledgement>
				<Identification xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">APP-0000166304</Identification>
				<Timestamp xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">2012-11-26T10:39:22.4094794+11:00</Timestamp>
			</ReceiptAcknowledgement>
			<StandardBusinessMessageHeader>
				<BusinessScope xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<Type>BusinessCollaboration</Type>
				</BusinessScope>
				<DocumentIdentification xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<CreationDateTime>2012-11-26T10:38:59.796658+11:00</CreationDateTime>
					<InstanceID identificationSchemeName="ApplicationNo">APP-0000166304</InstanceID>
					<Standard>eDAIS</Standard>
					<Type>ProposeCreateApplication</Type>
					<TypeVersion>2.3.0</TypeVersion>
				</DocumentIdentification>
				<ReceiverPartner xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<Authority>EHC</Authority>
					<Contact>
						<Contact>EHC HelpDesk</Contact>
						<ContactTypeIdentifier>EHC Support</ContactTypeIdentifier>
						<EmailAddress>EHC@planning.nsw.gov.au</EmailAddress>
						<TelephoneNumber>9228 6100</TelephoneNumber>
					</Contact>
					<ID>0001</ID>
					<ProcessRole>Initiator</ProcessRole>
				</ReceiverPartner>
				<SenderPartner xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<Authority>ApplicantSystem</Authority>
					<Contact>
						<Contact>Buildaform Dev</Contact>
						<ContactTypeIdentifier>Buildaform Support</ContactTypeIdentifier>
						<EmailAddress>buildaform-dev@envoyat.com</EmailAddress>
						<TelephoneNumber>8097 7328</TelephoneNumber>
					</Contact>
					<ID>0002</ID>
					<ProcessRole>Responder</ProcessRole>
				</SenderPartner>
				<Version xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2"/>
			</StandardBusinessMessageHeader>
		</ReceiptAcknowledgementSignal>
	</s:Body>
</s:Envelope>
